tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1575_tdd.h
#define PWM1PHH                       522
#define PWM1PHH0                      523
#define PWM1PHH_PH                    524
#define PWM1PHH1                      525
#define PWM1PHH2                      526
#define PWM1PHH3                      527
#define PWM1PHH4                      528
#define PWM1PHH5                      529
#define PWM1PHH6                      530
#define PWM1PHH7                      531
#define PWM1DCL_DC                    532
#define PWM1DCL                       533
#define PWM1DCL0                      534
#define PWM1DCL1                      535
#define PWM1DCL2                      536
#define PWM1DCL3                      537
#define PWM1DCL4                      538
#define PWM1DCL5                      539
#define PWM1DCL6                      540
#define PWM1DCL7                      541
#define PWM1DCH_DC                    542
#define PWM1DCH                       543
#define PWM1DCH0                      544
#define PWM1DCH1                      545
#define PWM1DCH2                      546
#define PWM1DCH3                      547
#define PWM1DCH4                      548
#define PWM1DCH5                      549
#define PWM1DCH6                      550
#define PWM1DCH7                      551
#define PWM1PRL                       552
#define PWM1PRL0                      553
#define PWM1PRL_PR                    554
#define PWM1PRL1                      555
#define PWM1PRL2                      556
#define PWM1PRL3                      557
#define PWM1PRL4                      558
#define PWM1PRL5                      559
#define PWM1PRL6                      560
#define PWM1PRL7                      561
#define PWM1PRH                       562
#define PWM1PRH_PR                    563
#define PWM1PRH0                      564
#define PWM1PRH1                      565
#define PWM1PRH2                      566
#define PWM1PRH3                      567
#define PWM1PRH4                      568
#define PWM1PRH5                      569
#define PWM1PRH6                      570
#define PWM1PRH7                      571
#define PWM1OFL0                      572
#define PWM1OFL_OF                    573
#define PWM1OFL                       574
#define PWM1OFL1                      575
#define PWM1OFL2                      576
#define PWM1OFL3                      577
#define PWM1OFL4                      578
#define PWM1OFL5                      579
#define PWM1OFL6                      580
#define PWM1OFL7                      581
#define PWM1OFH_OF                    582
#define PWM1OFH                       583
#define PWM1OFH0                      584
#define PWM1OFH1                      585
#define PWM1OFH2                      586
#define PWM1OFH3                      587
#define PWM1OFH4                      588
#define PWM1OFH5                      589
#define PWM1OFH6                      590
#define PWM1OFH7                      591
#define PWM1TMRL0                     592
#define PWM1TMRL_TMR                  593
#define PWM1TMRL                      594
#define PWM1TMRL1                     595
#define PWM1TMRL2                     596
#define PWM1TMRL3                     597
#define PWM1TMRL4                     598
#define PWM1TMRL5                     599
#define PWM1TMRL6                     600
#define PWM1TMRL7                     601
#define PWM1TMRH                      602
#define PWM1TMRH0                     603
#define PWM1TMRH_TMR                  604
#define PWM1TMRH1                     605
#define PWM1TMRH2                     606
#define PWM1TMRH3                     607
#define PWM1TMRH4                     608
#define PWM1TMRH5                     609
#define PWM1TMRH6                     610
#define PWM1TMRH7                     611
#define PWM1CON                       612
#define PWM1CON_MODE                  613
#define PWM1MODE0                     614
#define PWM1MODE                      615
#define PWM1CON_MODE0                 616
#define PWM1MODE1                     617
#define PWM1CON_MODE1                 618
#define PWM1CON_POL                   619
#define PWM1POL                       620
#define PWM1CON_OUT                   621
#define PWM1OUT                       622
#define PWM1OE                        623
#define PWM1CON_OE                    624
#define PWM1EN                        625
#define PWM1CON_EN                    626
#define PWM1INTE                      627
#define PWM1PRIE                      628
#define PWM1INTE_PRIE                 629
#define PWM1DCIE                      630
#define PWM1INTE_DCIE                 631
#define PWM1INTE_PHIE                 632
#define PWM1PHIE                      633
#define PWM1OFIE                      634
#define PWM1INTE_OFIE                 635
#define PWM1INTF                      636
#define PWM1INTF_PRIF                 637
#define PWM1PRIF                      638
#define PWM1INTF_DCIF                 639
#define PWM1DCIF                      640
#define PWM1PHIF                      641
#define PWM1INTF_PHIF                 642
#define PWM1OFIF                      643
#define PWM1INTF_OFIF                 644
#define PWM1CLKCON                    645
#define PWM1CLKCON_CS                 646
#define PWM1CS                        647
#define PWM1CLKCON_CS0                648
#define PWM1CS0                       649
#define PWM1CLKCON_CS1                650
#define PWM1CS1                       651
#define PWM1CLKCON_PS0                652
#define PWM1PS                        653
#define PWM1PS0                       654
#define PWM1CLKCON_PS                 655
#define PWM1PS1                       656
#define PWM1CLKCON_PS1                657
#define PWM1PS2                       658
#define PWM1CLKCON_PS2                659
#define PWM1LDCON                     660
#define PWM1LDCON_LDS0                661
#define PWM1LDS                       662
#define PWM1LDCON_LDS                 663
#define PWM1LDS0                      664
#define PWM1LDCON_LDS1                665
#define PWM1LDS1                      666
#define PWM1LDCON_LDT                 667
#define PWM1LDM                       668
#define PWM1LD                        669
#define PWM1LDCON_LDA                 670
#define PWM1OFCON                     671
#define PWM1OFCON_OFS0                672
#define PWM1OFS                       673
#define PWM1OFCON_OFS                 674
#define PWM1OFS0                      675
#define PWM1OFCON_OFS1                676
#define PWM1OFS1                      677
#define PWM1OFMC                      678
#define PWM1OFCON_OFO                 679
#define PWM1OFM0                      680
#define PWM1OFM                       681
#define PWM1OFCON_OFM0                682
#define PWM1OFCON_OFM                 683
#define PWM1OFM1                      684
#define PWM1OFCON_OFM1                685
#define PWM2PHL_PH                    686
#define PWM2PHL0                      687
#define PWM2PHL                       688
#define PWM2PHL1                      689
#define PWM2PHL2                      690
#define PWM2PHL3                      691
#define PWM2PHL4                      692
#define PWM2PHL5                      693
#define PWM2PHL6                      694
#define PWM2PHL7                      695
#define PWM2PHH0                      696
#define PWM2PHH                       697
#define PWM2PHH_PH                    698
#define PWM2PHH1                      699
#define PWM2PHH2                      700
#define PWM2PHH3                      701
#define PWM2PHH4                      702
#define PWM2PHH5                      703
#define PWM2PHH6                      704
#define PWM2PHH7                      705
#define PWM2DCL_DC                    706
#define PWM2DCL0                      707
#define PWM2DCL                       708
#define PWM2DCL1                      709
#define PWM2DCL2                      710
#define PWM2DCL3                      711
#define PWM2DCL4                      712
#define PWM2DCL5                      713
#define PWM2DCL6                      714
#define PWM2DCL7                      715
#define PWM2DCH0                      716
#define PWM2DCH_DC                    717
#define PWM2DCH                       718
#define PWM2DCH1                      719
#define PWM2DCH2                      720
#define PWM2DCH3                      721
#define PWM2DCH4                      722
#define PWM2DCH5                      723
#define PWM2DCH6                      724
#define PWM2DCH7                      725
#define PWM2PRL0                      726
#define PWM2PRL_PR                    727
#define PWM2PRL                       728
#define PWM2PRL1                      729
#define PWM2PRL2                      730
#define PWM2PRL3                      731
#define PWM2PRL4                      732
#define PWM2PRL5                      733
#define PWM2PRL6                      734
#define PWM2PRL7                      735
#define PWM2PRH0                      736
#define PWM2PRH                       737
#define PWM2PRH_PR                    738
#define PWM2PRH1                      739
#define PWM2PRH2                      740
#define PWM2PRH3                      741
#define PWM2PRH4                      742
#define PWM2PRH5                      743
#define PWM2PRH6                      744
#define PWM2PRH7                      745
#define PWM2OFL                       746
#define PWM2OFL_OF                    747
#define PWM2OFL0                      748
#define PWM2OFL1                      749
#define PWM2OFL2                      750
#define PWM2OFL3                      751
#define PWM2OFL4                      752
#define PWM2OFL5                      753
#define PWM2OFL6                      754
#define PWM2OFL7                      755
#define PWM2OFH                       756
#define PWM2OFH0                      757
#define PWM2OFH_OF                    758
#define PWM2OFH1                      759
#define PWM2OFH2                      760
#define PWM2OFH3                      761
#define PWM2OFH4                      762
#define PWM2OFH5                      763
#define PWM2OFH6                      764
#define PWM2OFH7                      765
#define PWM2TMRL_TMR                  766
#define PWM2TMRL0                     767
#define PWM2TMRL                      768
#define PWM2TMRL1                     769
#define PWM2TMRL2                     770
#define PWM2TMRL3                     771
#define PWM2TMRL4                     772
#define PWM2TMRL5                     773
#define PWM2TMRL6                     774
#define PWM2TMRL7                     775
#define PWM2TMRH_TMR                  776
#define PWM2TMRH                      777
#define PWM2TMRH0                     778
#define PWM2TMRH1                     779
#define PWM2TMRH2                     780
#define PWM2TMRH3                     781
#define PWM2TMRH4                     782
#define PWM2TMRH5                     783
#define PWM2TMRH6                     784
#define PWM2TMRH7                     785
#define PWM2CON                       786
#define PWM2MODE0                     787
#define PWM2MODE                      788
#define PWM2CON_MODE0                 789
#define PWM2CON_MODE                  790
#define PWM2MODE1                     791
#define PWM2CON_MODE1                 792
#define PWM2POL                       793
#define PWM2CON_POL                   794
#define PWM2CON_OUT                   795
#define PWM2OUT                       796
#define PWM2OE                        797
#define PWM2CON_OE                    798
#define PWM2EN                        799
#define PWM2CON_EN                    800
#define PWM2INTE                      801
#define PWM2INTE_PRIE                 802
#define PWM2PRIE                      803
#define PWM2INTE_DCIE                 804
#define PWM2DCIE                      805
#define PWM2INTE_PHIE                 806
#define PWM2PHIE                      807
#define PWM2INTE_OFIE                 808
#define PWM2OFIE                      809
#define PWM2INTF                      810
#define PWM2INTF_PRIF                 811
#define PWM2PRIF                      812
#define PWM2INTF_DCIF                 813
#define PWM2DCIF                      814
#define PWM2INTF_PHIF                 815
#define PWM2PHIF                      816
#define PWM2INTF_OFIF                 817
#define PWM2OFIF                      818
#define PWM2CLKCON                    819
#define PWM2CS0                       820
#define PWM2CS                        821
#define PWM2CLKCON_CS0                822
#define PWM2CLKCON_CS                 823
#define PWM2CLKCON_CS1                824
#define PWM2CS1                       825
#define PWM2CLKCON_PS                 826
#define PWM2CLKCON_PS0                827
#define PWM2PS0                       828
#define PWM2PS                        829
#define PWM2PS1                       830
#define PWM2CLKCON_PS1                831
#define PWM2PS2                       832
#define PWM2CLKCON_PS2                833
#define PWM2LDCON                     834
#define PWM2LDCON_LDS0                835
#define PWM2LDS0                      836
#define PWM2LDCON_LDS                 837
#define PWM2LDS                       838
#define PWM2LDS1                      839
#define PWM2LDCON_LDS1                840
#define PWM2LDM                       841
#define PWM2LDCON_LDT                 842
#define PWM2LD                        843
#define PWM2LDCON_LDA                 844
#define PWM2OFCON                     845
#define PWM2OFS                       846
#define PWM2OFS0                      847
#define PWM2OFCON_OFS0                848
#define PWM2OFCON_OFS                 849
#define PWM2OFCON_OFS1                850
#define PWM2OFS1                      851
#define PWM2OFMC                      852
#define PWM2OFCON_OFO                 853
#define PWM2OFCON_OFM0                854
#define PWM2OFM                       855
#define PWM2OFCON_OFM                 856
#define PWM2OFM0                      857
#define PWM2OFCON_OFM1                858
#define PWM2OFM1                      859
#define PWM3PHL                       860
#define PWM3PHL_PH                    861
#define PWM3PHL0                      862
#define PWM3PHL1                      863
#define PWM3PHL2                      864
#define PWM3PHL3                      865
#define PWM3PHL4                      866
#define PWM3PHL5                      867
#define PWM3PHL6                      868
#define PWM3PHL7                      869
#define PWM3PHH0                      870
#define PWM3PHH                       871
#define PWM3PHH_PH                    872
#define PWM3PHH1                      873
#define PWM3PHH2                      874
#define PWM3PHH3                      875
#define PWM3PHH4                      876
#define PWM3PHH5                      877
#define PWM3PHH6                      878
#define PWM3PHH7                      879
#define PWM3DCL_DC                    880
#define PWM3DCL0                      881
#define PWM3DCL                       882
#define PWM3DCL1                      883
#define PWM3DCL2                      884
#define PWM3DCL3                      885
#define PWM3DCL4                      886
#define PWM3DCL5                      887
#define PWM3DCL6                      888
#define PWM3DCL7                      889
#define PWM3DCH_DC                    890
#define PWM3DCH0                      891
#define PWM3DCH                       892
#define PWM3DCH1                      893
#define PWM3DCH2                      894
#define PWM3DCH3                      895
#define PWM3DCH4                      896
#define PWM3DCH5                      897
#define PWM3DCH6                      898
#define PWM3DCH7                      899
#define PWM3PRL0                      900
#define PWM3PRL                       901
#define PWM3PRL_PR                    902
#define PWM3PRL1                      903
#define PWM3PRL2                      904
#define PWM3PRL3                      905
#define PWM3PRL4                      906
#define PWM3PRL5                      907
#define PWM3PRL6                      908
#define PWM3PRL7                      909
#define PWM3PRH0                      910
#define PWM3PRH_PR                    911
#define PWM3PRH                       912
#define PWM3PRH1                      913
#define PWM3PRH2                      914
#define PWM3PRH3                      915
#define PWM3PRH4                      916
#define PWM3PRH5                      917
#define PWM3PRH6                      918
#define PWM3PRH7                      919
#define PWM3OFL_OF                    920
#define PWM3OFL0                      921
#define PWM3OFL                       922
#define PWM3OFL1                      923
#define PWM3OFL2                      924
#define PWM3OFL3                      925
#define PWM3OFL4                      926
#define PWM3OFL5                      927
#define PWM3OFL6                      928
#define PWM3OFL7                      929
#define PWM3OFH_OF                    930
#define PWM3OFH0                      931
#define PWM3OFH                       932
#define PWM3OFH1                      933
#define PWM3OFH2                      934
#define PWM3OFH3                      935
#define PWM3OFH4                      936
#define PWM3OFH5                      937
#define PWM3OFH6                      938
#define PWM3OFH7                      939
#define PWM3TMRL0                     940
#define PWM3TMRL                      941
#define PWM3TMRL_TMR                  942
#define PWM3TMRL1                     943
#define PWM3TMRL2                     944
#define PWM3TMRL3                     945
#define PWM3TMRL4                     946
#define PWM3TMRL5                     947
#define PWM3TMRL6                     948
#define PWM3TMRL7                     949
#define PWM3TMRH0                     950
#define PWM3TMRH_TMR                  951
#define PWM3TMRH                      952
#define PWM3TMRH1                     953
#define PWM3TMRH2                     954
#define PWM3TMRH3                     955
#define PWM3TMRH4                     956
#define PWM3TMRH5                     957
#define PWM3TMRH6                     958
#define PWM3TMRH7                     959
#define PWM3CON                       960
#define PWM3CON_MODE0                 961
#define PWM3MODE                      962
#define PWM3CON_MODE                  963
#define PWM3MODE0                     964
#define PWM3CON_MODE1                 965
#define PWM3MODE1                     966
#define PWM3CON_POL                   967
#define PWM3POL                       968
#define PWM3CON_OUT                   969
#define PWM3OUT                       970
#define PWM3OE                        971
#define PWM3CON_OE                    972
#define PWM3EN                        973
#define PWM3CON_EN                    974
#define PWM3INTE                      975
#define PWM3PRIE                      976
#define PWM3INTE_PRIE                 977
#define PWM3INTE_DCIE                 978
#define PWM3DCIE                      979
#define PWM3PHIE                      980
#define PWM3INTE_PHIE                 981
#define PWM3INTE_OFIE                 982
#define PWM3OFIE                      983
#define PWM3INTF                      984
#define PWM3PRIF                      985
#define PWM3INTF_PRIF                 986
#define PWM3INTF_DCIF                 987
#define PWM3DCIF                      988
#define PWM3INTF_PHIF                 989
#define PWM3PHIF                      990
#define PWM3INTF_OFIF                 991
#define PWM3OFIF                      992
#define PWM3CLKCON                    993
#define PWM3CLKCON_CS                 994
#define PWM3CS                        995
#define PWM3CS0                       996
#define PWM3CLKCON_CS0                997
#define PWM3CS1                       998
#define PWM3CLKCON_CS1                999
#define PWM3PS0                       1000
#define PWM3CLKCON_PS                 1001
#define PWM3CLKCON_PS0                1002
#define PWM3PS                        1003
#define PWM3PS1                       1004
#define PWM3CLKCON_PS1                1005
#define PWM3PS2                       1006
#define PWM3CLKCON_PS2                1007
#define PWM3LDCON                     1008
#define PWM3LDCON_LDS                 1009
#define PWM3LDS0                      1010
#define PWM3LDS                       1011
#define PWM3LDCON_LDS0                1012
#define PWM3LDS1                      1013
#define PWM3LDCON_LDS1                1014
#define PWM3LDCON_LDT                 1015
#define PWM3LDM                       1016
#define PWM3LDCON_LDA                 1017
#define PWM3LD                        1018
#define PWM3OFCON                     1019
#define PWM3OFS                       1020
#define PWM3OFCON_OFS0                1021
#define PWM3OFS0                      1022
#define PWM3OFCON_OFS                 1023
#define PWM3OFCON_OFS1                1024
#define PWM3OFS1                      1025
#define PWM3OFMC                      1026
#define PWM3OFCON_OFO                 1027
#define PWM3OFM0                      1028
#define PWM3OFCON_OFM0                1029
#define PWM3OFCON_OFM                 1030
#define PWM3OFM                       1031
#define PWM3OFM1                      1032
#define PWM3OFCON_OFM1                1033
#define PWM4PHL_PH                    1034
#define PWM4PHL                       1035
#define PWM4PHL0                      1036
#define PWM4PHL1                      1037
#define PWM4PHL2                      1038
#define PWM4PHL3                      1039
#define PWM4PHL4                      1040
#define PWM4PHL5                      1041
#define PWM4PHL6                      1042
#define PWM4PHL7                      1043
#define PWM4PHH                       1044
#define PWM4PHH0                      1045
#define PWM4PHH_PH                    1046
#define PWM4PHH1                      1047
#define PWM4PHH2                      1048
#define PWM4PHH3                      1049
#define PWM4PHH4                      1050
#define PWM4PHH5                      1051
#define PWM4PHH6                      1052
#define PWM4PHH7                      1053
#define PWM4DCL0                      1054
#define PWM4DCL                       1055
#define PWM4DCL_DC                    1056
#define PWM4DCL1                      1057
#define PWM4DCL2                      1058
#define PWM4DCL3                      1059
#define PWM4DCL4                      1060
#define PWM4DCL5                      1061
#define PWM4DCL6                      1062
#define PWM4DCL7                      1063
#define PWM4DCH0                      1064
#define PWM4DCH                       1065
#define PWM4DCH_DC                    1066
#define PWM4DCH1                      1067
#define PWM4DCH2                      1068
#define PWM4DCH3                      1069
#define PWM4DCH4                      1070
#define PWM4DCH5                      1071
#define PWM4DCH6                      1072
#define PWM4DCH7                      1073
#define PWM4PRL_PR                    1074
#define PWM4PRL                       1075
#define PWM4PRL0                      1076
#define PWM4PRL1                      1077
#define PWM4PRL2                      1078
#define PWM4PRL3                      1079
#define PWM4PRL4                      1080
#define PWM4PRL5                      1081
#define PWM4PRL6                      1082
#define PWM4PRL7                      1083
#define PWM4PRH0                      1084
#define PWM4PRH                       1085
#define PWM4PRH_PR                    1086
#define PWM4PRH1                      1087
#define PWM4PRH2                      1088
#define PWM4PRH3                      1089
#define PWM4PRH4                      1090
